backend/app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `user_capturas`
SELECT COUNT(*) AS `numrows`
FROM `teams`
SELECT COUNT(*) AS `numrows`
FROM `noticias`
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function dashboardStats()
    {
        $user = $this->getUserFromToken();
        if (!$user || $user->role !== 'admin') return $this->failForbidden('Acceso denegado.');

        $db = \Config\Database::connect();
        try {
            $stats = [
                'usuarios' => $db->table('users')->countAllResults(),
                'noticias' => $db->table('noticias')->countAllResults(),
                'equipos'  => $db->table('teams')->countAllResults(),
                'capturas' => $db->table('user_capturas')->countAllResults()
            ];

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function getUsers() {
        if (!$this->esAdmin()) return $this->failForbidden();
        $db = \Config\Database::connect();
        $users = $db->table('users')->orderBy('id', 'DESC')->get()->getResultArray();