backend/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@pokeweb.com'
 LIMIT 1
---
    public function login()
    {
        $input = $this->request->getJSON(true);
        $userModel = new UserModel();

        $user = $userModel->where('email', $input['email'] ?? '')->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
UPDATE `users` SET `password` = '$2y$10$US75REt.xo259ZYUNC6zJOFg.xloQi8Qi4a3kcXHraHO1T1eMjIt.'
WHERE `users`.`id` IN ('2')
---
    public function changePassword()
    {
        $userToken = $this->getUserFromToken();
        if (!$userToken) return $this->failUnauthorized();

        $json = $this->request->getJSON();

        $current = $json->currentPassword ?? '';
        $new = $json->newPassword ?? '';
        $confirm = $json->confirmPassword ?? '';

        if ($new !== $confirm) {
            return $this->fail('Las contraseñas nuevas no coinciden');
        }
        if (strlen($new) < 6) {
            return $this->fail('La contraseña nueva es muy corta');
        }

        $userModel = new UserModel();
        // Obtener datos reales de la BD para verificar la contraseña vieja
        $uid = $userToken->uid ?? null;
        $dbUser = $userModel->find($uid);

        if (!$dbUser || !password_verify($current, $dbUser['password'])) {
            return $this->fail('La contraseña actual es incorrecta', 401);
        }

        // Guardar nueva
        $userModel->update($uid, [
            'password' => password_hash($new, PASSWORD_DEFAULT)
        ]);

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
---
    public function me()
    {
        $userToken = $this->getUserFromToken();

        if (!$userToken) {
            return $this->failUnauthorized('Sesión inválida');
        }

        $userModel = new UserModel();
        // Buscamos en la BD usando el ID del token
        $data = $userModel->find($userToken->uid);