backend/app/Controllers/Noticias.php

UPDATE `noticias` SET `titulo` = '32423423 ggregerg', `resumen` = '', `contenido` = '34235235', `imagen` = '', `autor_id` = '1', `created_at` = '2026-02-15 19:06:44', `destacada` = '0'
WHERE `noticias`.`id` IN ('12')
---
    public function update($id = null) {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $noticia = $this->model->find($id);
        if (!$noticia) return $this->failNotFound();

        if ($user->role !== 'admin' && $noticia['autor_id'] != $user->uid) {
            return $this->failForbidden();
        }

        $data = $this->request->getJSON(true);
        if (!$data) $data = $this->request->getRawInput();

        if ($user->role !== 'admin' && isset($data['destacada'])) {
            unset($data['destacada']);
        }

        try {
            if ($this->model->update($id, $data)) {