backend/app/Controllers/Pokemon.php

    public function toggleCatch()
    {
        $user = $this->getUserFromToken();

        if (!$user) {
            return $this->failUnauthorized('Sesión expirada o inválida');
        }

        $json = $this->request->getJSON();
        $pokemonId = $json->pokemon_id ?? null;

        if (!$pokemonId) return $this->fail('Falta ID Pokemon');

        $capturaModel = new CapturaModel();

        // Acceso seguro al ID
        $userId = $user->uid ?? null;

        $existe = $capturaModel->where('user_id', $userId)
                               ->where('pokemon_id', $pokemonId)
                               ->first();

        if ($existe) {
            // Soltar
            $capturaModel->delete($existe['id']);
            return $this->respond(['status' => 'released']);
        } else {
            // Atrapar
            $capturaModel->insert([
                'user_id' => $userId,
                'pokemon_id' => $pokemonId
            ]);
---
SELECT *
FROM `user_capturas`
WHERE `user_id` = '2'
AND `pokemon_id` = 108
 LIMIT 1
DELETE FROM `user_capturas`
WHERE `id` IN ('1')
INSERT INTO `user_capturas` (`user_id`, `pokemon_id`) VALUES ('2', 108)

    public function getCapturas($userId = null)
    {
        // Si no viene ID en la URL, usamos el del token
        if (!$userId) {
            $user = $this->getUserFromToken();
            $userId = $user->uid ?? null;
        }

        if (!$userId) return $this->fail('Usuario desconocido');

        $capturaModel = new CapturaModel();
        // Seleccionamos solo la columna pokemon_id para devolver array simple
        $data = $capturaModel->select('pokemon_id')->where('user_id', $userId)->findAll();
---
SELECT `pokemon_id`
FROM `user_capturas`
WHERE `user_id` = '11'