backend/app/Controllers/Teams.php

    public function index() {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $teamModel = new TeamModel();
        $memberModel = new TeamMemberModel();

        $userId = $user->uid ?? null;

        $teams = $teamModel->where('user_id', $userId)->findAll();

        foreach ($teams as &$team) {
            $team['members'] = $memberModel->where('team_id', $team['id'])
                                           ->orderBy('slot_order', 'ASC')
                                           ->findAll();
---
SELECT *
FROM `teams`
WHERE `user_id` = '13'
SELECT *
FROM `team_members`
WHERE `team_id` = '13'
ORDER BY `slot_order` ASC

    public function create() {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $json = $this->request->getJSON();
        $name = $json->name ?? 'Nuevo Equipo';

        $teamModel = new TeamModel();
        $teamModel->insert([
            'user_id' => $user->uid,
            'name' => $name
        ]);
---
INSERT INTO `teams` (`user_id`, `name`, `created_at`) VALUES ('2', 'gfdgdfg', '2026-02-15 13:15:16')

    public function addMember() {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $json = $this->request->getJSON();
        $teamId = $json->team_id;
        $pokemonId = $json->pokemon_id;

        $teamModel = new TeamModel();
        $memberModel = new TeamMemberModel();

        $team = $teamModel->find($teamId);
        if (!$team || $team['user_id'] != $user->uid) return $this->failForbidden();

        $count = $memberModel->where('team_id', $teamId)->countAllResults();
        if ($count >= 6) return $this->fail('Equipo lleno (Máx 6)');

        $memberModel->insert([
            'team_id' => $teamId,
            'pokemon_id' => $pokemonId,
            'slot_order' => $count + 1
        ]);
---
SELECT *
FROM `teams`
WHERE `teams`.`id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `team_members`
WHERE `team_id` = '1'
INSERT INTO `team_members` (`team_id`, `pokemon_id`, `slot_order`) VALUES ('1', 5, 3)

    public function update($id = null) {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $json = $this->request->getJSON();
        $newName = $json->name ?? null;

        if (!$newName) return $this->fail('El nombre es obligatorio');

        $teamModel = new TeamModel();
        $team = $teamModel->find($id);

        if (!$team || $team['user_id'] != $user->uid) {
            return $this->failForbidden('No tienes permiso para editar este equipo');
        }

        $teamModel->update($id, ['name' => $newName]);
---
SELECT *
FROM `teams`
WHERE `teams`.`id` = '1'
UPDATE `teams` SET `name` = 'equipo A'
WHERE `teams`.`id` IN ('5')

    public function removeMember($memberId = null) {
        $user = $this->getUserFromToken();
        if (!$user) return $this->failUnauthorized();

        $memberModel = new TeamMemberModel();
        $teamModel = new TeamModel();

        $member = $memberModel->find($memberId);
        if (!$member) return $this->failNotFound();

        $team = $teamModel->find($member['team_id']);
---
SELECT *
FROM `teams`
WHERE `teams`.`id` = '5'